STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_camera.c
  ret = CameraDrv->SetHueDegree(CompObj, HueDegree);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  CameraCtx[Instance].HueDegree = HueDegree;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Get the camera Hue Degree.
  * @param  Instance   Camera instance.
  * @param  HueDegree  Hue Degree
  * @retval BSP status
  */
int32_t BSP_CAMERA_GetHueDegree(uint32_t Instance, int32_t *HueDegree)
{
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->HueDegree == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  *HueDegree = CameraCtx[Instance].HueDegree;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Set the camera gain.
  * @param  Instance Camera instance.
  * @param  Gain     Gain in dB
  * @retval BSP status
  */
int32_t BSP_CAMERA_SetGain(uint32_t Instance, int32_t Gain)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->Gain == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  ret = CameraDrv->SetGain(CompObj, Gain);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  CameraCtx[Instance].Gain = Gain;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Get the camera gain.
  * @param  Instance Camera instance.
  * @param  Gain     Gain in dB
  * @retval BSP status
  */
int32_t BSP_CAMERA_GetGain(uint32_t Instance, int32_t *Gain)
{
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->Gain == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  *Gain = CameraCtx[Instance].Gain;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Set the camera exposure.
  * @param  Instance Camera instance.
  * @param  Exposure Exposure in microseconds
  * @retval BSP status
  */
int32_t BSP_CAMERA_SetExposure(uint32_t Instance, int32_t Exposure)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->Exposure == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  ret = CameraDrv->SetExposure(CompObj, Exposure);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  CameraCtx[Instance].Exposure = Exposure;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Get the camera exposure.
  * @param  Instance Camera instance.
  * @param  Exposure Exposure in microseconds
  * @retval BSP status
  */
int32_t BSP_CAMERA_GetExposure(uint32_t Instance, int32_t *Exposure)
{
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->Exposure == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  *Exposure = CameraCtx[Instance].Exposure;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Set the camera Mirror/Flip.
  * @param  Instance  Camera instance.
  * @param  MirrorFlip CAMERA_MIRRORFLIP_NONE or any combination of
  *                    CAMERA_MIRRORFLIP_FLIP and CAMERA_MIRRORFLIP_MIRROR
  * @retval BSP status
  */
int32_t BSP_CAMERA_SetMirrorFlip(uint32_t Instance, uint32_t MirrorFlip)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->MirrorFlip == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  ret = CameraDrv->MirrorFlipConfig(CompObj, MirrorFlip);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  CameraCtx[Instance].MirrorFlip = MirrorFlip;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Get the camera Mirror/Flip.
  * @param  Instance   Camera instance.
  * @param  MirrorFlip Mirror/Flip config
  * @retval BSP status
  */
int32_t BSP_CAMERA_GetMirrorFlip(uint32_t Instance, uint32_t *MirrorFlip)
{
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->MirrorFlip == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  *MirrorFlip = CameraCtx[Instance].MirrorFlip;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Set the camera zoom
  * @param  Instance Camera instance.
  * @param  Zoom     Zoom to be configured
  * @retval BSP status
  */
int32_t BSP_CAMERA_SetZoom(uint32_t Instance, uint32_t Zoom)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->Zoom == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  ret = CameraDrv->ZoomConfig(CompObj, Zoom);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  CameraCtx[Instance].Zoom = Zoom;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Get the camera zoom
  * @param  Instance Camera instance.
  * @param  Zoom     Zoom to be returned
  * @retval BSP status
  */
int32_t BSP_CAMERA_GetZoom(uint32_t Instance, uint32_t *Zoom)
{
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->Zoom == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  *Zoom = CameraCtx[Instance].Zoom;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Enable the camera night mode
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_EnableNightMode(uint32_t Instance)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->NightMode == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  ret = CameraDrv->NightModeConfig(CompObj, CAMERA_NIGHT_MODE_SET);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}

/**
  * @brief  Disable the camera night mode
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_DisableNightMode(uint32_t Instance)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->NightMode == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  ret = CameraDrv->NightModeConfig(CompObj, CAMERA_NIGHT_MODE_RESET);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}

/**
  * @brief  CAMERA hardware reset
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_HwReset(uint32_t Instance)
{
  UNUSED(Instance);

  int32_t ret = BSP_ERROR_NONE;
  /* Camera sensor RESET sequence */
  GPIO_InitTypeDef  gpio_init_structure;

  /*** Configure the GPIOs ***/
  CAMERA_STBYN_GPIO_CLK_ENABLE();
  CAMERA_RST_GPIO_CLK_ENABLE();

  gpio_init_structure.Pin = CAMERA_STBYN_PIN;
  gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(CAMERA_STBYN_GPIO_PORT, &gpio_init_structure);

  gpio_init_structure.Pin = CAMERA_RST_PIN;
  HAL_GPIO_Init(CAMERA_RST_GPIO_PORT, &gpio_init_structure);

#if defined(USE_CAMERA_SENSOR_OV5640)
#if defined(USE_CSI_INTERFACE)
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_SET);
  HAL_Delay(5);
  HAL_GPIO_WritePin(CAMERA_RST_GPIO_PORT, CAMERA_RST_PIN, GPIO_PIN_SET);
  HAL_Delay(25);
#else
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_SET);
  HAL_GPIO_WritePin(CAMERA_RST_GPIO_PORT, CAMERA_RST_PIN, GPIO_PIN_SET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_RESET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_SET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_RST_GPIO_PORT, CAMERA_RST_PIN, GPIO_PIN_RESET);
  HAL_Delay(100);
#endif /* USE_CSI_INTERFACE */
#elif defined(USE_CAMERA_SENSOR_IMX219)
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_RESET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_RST_GPIO_PORT, CAMERA_RST_PIN, GPIO_PIN_RESET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_RST_GPIO_PORT, CAMERA_RST_PIN, GPIO_PIN_SET);
  HAL_Delay(100);
#elif defined(USE_CAMERA_SENSOR_IMX335)
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_RESET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_RST_GPIO_PORT, CAMERA_RST_PIN, GPIO_PIN_RESET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_SET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_RST_GPIO_PORT, CAMERA_RST_PIN, GPIO_PIN_SET);
  HAL_Delay(100);
#endif /* USE_CAMERA_SENSOR_OV5640 */

  return ret;
}

/**
  * @}
  */

