STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_camera.c
/** @defgroup STM32MP257F_EV1_CAMERA_Private_Functions Private Functions
  * @{
  */

/**
  * @brief  Get the capture size in pixels unit.
  * @param  Resolution  the current resolution.
  * @retval capture size in pixels unit.
  */
int32_t GetSize(uint32_t Resolution, uint32_t PixelFormat)
{
  uint32_t size = 0;
  uint32_t pf_div;
  if (PixelFormat == CAMERA_PF_RGB888)
  {
    pf_div = 3; /* each pixel on 3 bytes so 3/4 words */
  }
  else
  {
    pf_div = 2; /* each pixel on 2 bytes so 1/2 words*/
  }
  /* Get capture size */
  switch (Resolution)
  {
    case CAMERA_R160x120:
      size = ((uint32_t)(160 * 120) * pf_div);
      break;
    case CAMERA_R320x240:
      size = ((uint32_t)(320 * 240) * pf_div);
      break;
    case CAMERA_R480x272:
      size = ((uint32_t)(480 * 272) * pf_div);
      break;
    case CAMERA_R640x480:
      size = ((uint32_t)(640 * 480) * pf_div);
      break;
    case CAMERA_R800x480:
      size = ((uint32_t)(800 * 480) * pf_div);
      break;
    default:
      break;
  }

  return (int32_t)size;
}

/**
  * @}
  */

/** @addtogroup STM32MP257F_EV1_CAMERA_Private_FunctionPrototypes Private Function Prototypes
  * @{
  */
/**
  * @brief  Register Bus IOs if component ID is OK
  * @retval error status
  */
/* #warning !!! On FPGA, OV5640 pixel clock must be reduced, ensure to apply patch !!!

diff --git a/ov5640.c b/ov5640.c
index 42e14ee04497..5e5d0471542d 100644
--- a/ov5640.c
+++ b/ov5640.c
@@ -145,8 +145,8 @@ int32_t OV5640_Init(OV5640_Object_t *pObj, uint32_t Resolution, uint32_t PixelFo
     {OV5640_PAD_OUTPUT_ENABLE02, 0xf3},
     {OV5640_SC_PLL_CONTRL0, 0x18},
     {OV5640_SYSTEM_CTROL0, 0x02},
-    {OV5640_SC_PLL_CONTRL1, 0x41},
-    {OV5640_SC_PLL_CONTRL2, 0x60},
+    {OV5640_SC_PLL_CONTRL1, 0x40},
+    {OV5640_SC_PLL_CONTRL2, 0x04},
     {OV5640_SC_PLL_CONTRL3, 0x13},
     {OV5640_SYSTEM_ROOT_DIVIDER, 0x01},
     {0x3630, 0x36},
 */
#ifdef USE_CAMERA_SENSOR_OV5640
static int32_t OV5640_Probe(uint32_t Resolution, uint32_t PixelFormat)
{
  int32_t ret;
  OV5640_IO_t              IOCtx;
  uint32_t                  id;

  /* Only perform the init if the object already exist */
  if (!CompObj)
  {
    /* Configure the I2C driver */
    IOCtx.Address     = CAMERA_OV5640_ADDRESS;
    IOCtx.Init        = BSP_I2C2_Init;
    IOCtx.DeInit      = BSP_I2C2_DeInit;
    IOCtx.ReadReg     = BSP_I2C2_ReadReg16;
    IOCtx.WriteReg    = BSP_I2C2_WriteReg16;
    IOCtx.GetTick     = BSP_GetTick;

    ret = OV5640_RegisterBusIO(&OV5640Obj, &IOCtx);
    if (ret != OV5640_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    ret = OV5640_ReadID(&OV5640Obj, &id);
    if (ret != OV5640_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    if (id != OV5640_ID)
    {
      return BSP_ERROR_UNKNOWN_COMPONENT;
    }

    CameraDrv = (CAMERA_Drv_t *) &OV5640_CAMERA_Driver;
    CompObj = &OV5640Obj;
    CameraCap = &Cap;
  }

  ret = CameraDrv->Init(CompObj, Resolution, PixelFormat);
  if (ret != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  ret = CameraDrv->GetCapabilities(CompObj, CameraCap);
  if (ret != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}
#endif /* USE_CAMERA_SENSOR_OV5640 */

/**
  * @brief  Register Bus IOs if component ID is OK
  * @retval error status
  */
#ifdef USE_CAMERA_SENSOR_IMX219
static int32_t IMX219_Probe(uint32_t Resolution, uint32_t PixelFormat)
{
  int32_t ret;
  IMX219_IO_t              IOCtx;
  uint32_t                  id;

  /* Only perform the init if the object already exist */
  if (!CompObj)
  {
    /* Configure the I2C driver */
    IOCtx.Address     = CAMERA_IMX219_ADDRESS;
    IOCtx.Init        = BSP_I2C2_Init;
    IOCtx.DeInit      = BSP_I2C2_DeInit;
    IOCtx.ReadReg     = BSP_I2C2_ReadReg16;
    IOCtx.WriteReg    = BSP_I2C2_WriteReg16;
    IOCtx.GetTick     = BSP_GetTick;

    ret = IMX219_RegisterBusIO(&IMX219Obj, &IOCtx);
    if (ret != IMX219_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    ret = IMX219_ReadID(&IMX219Obj, &id);
    if (ret != IMX219_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    if (id != IMX219_CHIP_ID)
    {
      return BSP_ERROR_UNKNOWN_COMPONENT;
    }

    CameraDrv = (CAMERA_Drv_t *) &IMX219_CAMERA_Driver;
    CompObj = &IMX219Obj;
    CameraCap = &Cap;
  }

  ret = CameraDrv->Init(CompObj, Resolution, PixelFormat);
  if (ret != IMX219_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  ret = CameraDrv->GetCapabilities(CompObj, CameraCap);
  if (ret != IMX219_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}
#endif /* USE_CAMERA_SENSOR_IMX219 */

#ifdef USE_CAMERA_SENSOR_IMX335
static int32_t IMX335_Probe(uint32_t Resolution, uint32_t PixelFormat)
{
  int32_t ret;
  IMX335_IO_t              IOCtx;
  uint32_t                  id;

  /* Only perform the init if the object already exist */
  if (!CompObj)
  {
    /* Configure the I2C driver */
    IOCtx.Address     = CAMERA_IMX335_ADDRESS;
    IOCtx.Init        = BSP_I2C2_Init;
    IOCtx.DeInit      = BSP_I2C2_DeInit;
    IOCtx.ReadReg     = BSP_I2C2_ReadReg16;
    IOCtx.WriteReg    = BSP_I2C2_WriteReg16;
    IOCtx.GetTick     = BSP_GetTick;

    ret = IMX335_RegisterBusIO(&IMX335Obj, &IOCtx);
    if (ret != IMX335_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    ret = IMX335_ReadID(&IMX335Obj, &id);
    if (ret != IMX335_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    if (id != IMX335_CHIP_ID)
    {
      return BSP_ERROR_UNKNOWN_COMPONENT;
    }

    CameraDrv = (CAMERA_Drv_t *) &IMX335_CAMERA_Driver;
    CompObj = &IMX335Obj;
    CameraCap = &Cap;
  }

  ret = CameraDrv->Init(CompObj, Resolution, PixelFormat);
  if (ret != IMX335_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  ret = CameraDrv->GetCapabilities(CompObj, CameraCap);
  if (ret != IMX335_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}
#endif /* USE_CAMERA_SENSOR_IMX335 */

int32_t BSP_CAMERA_SetColorbarMode(uint32_t Instance, uint32_t Mode)
{
  UNUSED(Instance);

#ifdef USE_CAMERA_SENSOR_OV5640
  if (OV5640_ColorbarModeConfig(CompObj, Mode) != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
#else
  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* USE_CAMERA_SENSOR_OV5640 */
}

int32_t BSP_CAMERA_SetPolarities(uint32_t Instance, uint32_t Pclk, uint32_t Href, uint32_t Vsync)
{
  UNUSED(Instance);

#ifdef USE_CAMERA_SENSOR_OV5640
  if (OV5640_SetPolarities(CompObj,
                           Pclk ? OV5640_POLARITY_PCLK_HIGH : OV5640_POLARITY_PCLK_LOW,
                           Href ? OV5640_POLARITY_HREF_HIGH : OV5640_POLARITY_HREF_LOW,
                           Vsync ? OV5640_POLARITY_VSYNC_HIGH : OV5640_POLARITY_VSYNC_LOW) != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
#else
  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* USE_CAMERA_SENSOR_OV5640 */
}

int32_t BSP_CAMERA_SetSynchroCodes(uint32_t Instance, uint32_t FSC, uint32_t LSC, uint32_t LEC, uint32_t FEC)
{
  UNUSED(Instance);

#ifdef USE_CAMERA_SENSOR_OV5640
  OV5640_SyncCodes_t SyncCode;

  SyncCode.FrameStartCode = FSC;
  SyncCode.LineStartCode = LSC;
  SyncCode.LineEndCode = LEC;
  SyncCode.FrameEndCode = FEC;

  if (OV5640_EmbeddedSynchroConfig(CompObj, &SyncCode) != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
#else
  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* USE_CAMERA_SENSOR_OV5640 */
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
